Revit 2027 API
IFCProductWrapper.AddFinishMaterial Method
 Adds a material handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddFinishMaterial(
	IFCAnyHandle material
)
Public Sub AddFinishMaterial (
	material As IFCAnyHandle
)
public:
void AddFinishMaterial(
	IFCAnyHandle^ material
)
member AddFinishMaterial :
        material : IFCAnyHandle -> unit
Parameters
material IFCAnyHandle
 The material handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace